In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
dates = pd.date_range('20211022', periods = 6)
dates

DatetimeIndex(['2021-10-22', '2021-10-23', '2021-10-24', '2021-10-25',
               '2021-10-26', '2021-10-27'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df = pd.DataFrame(np.random.rand(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2021-10-22  0.941797  0.396187  0.868382  0.161483
2021-10-23  0.005997  0.925609  0.034613  0.779184
2021-10-24  0.924908  0.503157  0.387768  0.056802
2021-10-25  0.002825  0.141465  0.124655  0.666112
2021-10-26  0.204402  0.514732  0.206505  0.699342
2021-10-27  0.649920  0.598224  0.423738  0.745474

In [47]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20211022'),
                    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                    'D': np.array([3]*4, dtype='int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2021-10-22  1.0  3   test  foo
1  1.0 2021-10-22  1.0  3  train  foo
2  1.0 2021-10-22  1.0  3   test  foo
3  1.0 2021-10-22  1.0  3  train  foo

In [27]:
d1 = pd.DataFrame(df2.dtypes)
d1

                0
A         float64
B  datetime64[ns]
C         float32
D           int32
E        category
F          object

In [29]:
pd.DataFrame(df2.A)

     A
0  1.0
1  1.0
2  1.0
3  1.0

In [30]:
pd.DataFrame(df2.B)

           B
0 2021-10-22
1 2021-10-22
2 2021-10-22
3 2021-10-22

In [31]:
pd.DataFrame(df2.C)

     C
0  1.0
1  1.0
2  1.0
3  1.0

In [32]:
pd.DataFrame(df2.D)

   D
0  3
1  3
2  3
3  3

In [33]:
pd.DataFrame(df2.E)

       E
0   test
1  train
2   test
3  train

In [34]:
pd.DataFrame(df2.F)

     F
0  foo
1  foo
2  foo
3  foo

In [40]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2021-10-22  1.0  3   test  foo
1  1.0 2021-10-22  1.0  3  train  foo

In [38]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2021-10-22  1.0  3   test  foo
3  1.0 2021-10-22  1.0  3  train  foo

In [41]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [42]:
df2.values

array([[1.0, Timestamp('2021-10-22 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2021-10-22 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2021-10-22 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2021-10-22 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [43]:
df.index

DatetimeIndex(['2021-10-22', '2021-10-23', '2021-10-24', '2021-10-25',
               '2021-10-26', '2021-10-27'],
              dtype='datetime64[ns]', freq='D')

In [44]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [48]:
df2

     A          B    C  D      E    F
0  1.0 2021-10-22  1.0  3   test  foo
1  1.0 2021-10-22  1.0  3  train  foo
2  1.0 2021-10-22  1.0  3   test  foo
3  1.0 2021-10-22  1.0  3  train  foo